zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp257dxx_cm0.h
/*******************  Bit definition for EXTI2_CmIMR2 register  *******************/
/* No interrupt line 32 */
#define EXTI2_IMR2_IM33_Pos         (1U)
#define EXTI2_IMR2_IM33_Msk         (0x1UL << EXTI2_IMR2_IM33_Pos)                /*!< 0x00000002 */
#define EXTI2_IMR2_IM33             EXTI2_IMR2_IM33_Msk                          /*!< Interrupt Mask on line 33 */
#define EXTI2_IMR2_IM34_Pos         (2U)
#define EXTI2_IMR2_IM34_Msk         (0x1UL << EXTI2_IMR2_IM34_Pos)                /*!< 0x00000004 */
#define EXTI2_IMR2_IM34             EXTI2_IMR2_IM34_Msk                          /*!< Interrupt Mask on line 34 */
#define EXTI2_IMR2_IM35_Pos         (3U)
#define EXTI2_IMR2_IM35_Msk         (0x1UL << EXTI2_IMR2_IM35_Pos)                /*!< 0x00000008 */
#define EXTI2_IMR2_IM35             EXTI2_IMR2_IM35_Msk                          /*!< Interrupt Mask on line 35 */
#define EXTI2_IMR2_IM36_Pos         (4U)
#define EXTI2_IMR2_IM36_Msk         (0x1UL << EXTI2_IMR2_IM36_Pos)                /*!< 0x00000010 */
#define EXTI2_IMR2_IM36             EXTI2_IMR2_IM36_Msk                          /*!< Interrupt Mask on line 36 */
#define EXTI2_IMR2_IM37_Pos         (5U)
#define EXTI2_IMR2_IM37_Msk         (0x1UL << EXTI2_IMR2_IM37_Pos)                /*!< 0x00000020 */
#define EXTI2_IMR2_IM37             EXTI2_IMR2_IM37_Msk                          /*!< Interrupt Mask on line 37 */
#define EXTI2_IMR2_IM38_Pos         (6U)
#define EXTI2_IMR2_IM38_Msk         (0x1UL << EXTI2_IMR2_IM38_Pos)                /*!< 0x00000040 */
#define EXTI2_IMR2_IM38             EXTI2_IMR2_IM38_Msk                          /*!< Interrupt Mask on line 38 */
/* No interrupt line 39 */
#define EXTI2_IMR2_IM40_Pos         (8U)
#define EXTI2_IMR2_IM40_Msk         (0x1UL << EXTI2_IMR2_IM40_Pos)                /*!< 0x00000100 */
#define EXTI2_IMR2_IM40             EXTI2_IMR2_IM40_Msk                          /*!< Interrupt Mask on line 40 */
#define EXTI2_IMR2_IM41_Pos         (9U)
#define EXTI2_IMR2_IM41_Msk         (0x1UL << EXTI2_IMR2_IM41_Pos)                /*!< 0x00000200 */
#define EXTI2_IMR2_IM41             EXTI2_IMR2_IM41_Msk                          /*!< Interrupt Mask on line 41 */
#define EXTI2_IMR2_IM42_Pos         (10U)
#define EXTI2_IMR2_IM42_Msk         (0x1UL << EXTI2_IMR2_IM42_Pos)                /*!< 0x00000400 */
#define EXTI2_IMR2_IM42             EXTI2_IMR2_IM42_Msk                          /*!< Interrupt Mask on line 42 */
#define EXTI2_IMR2_IM43_Pos         (11U)
#define EXTI2_IMR2_IM43_Msk         (0x1UL << EXTI2_IMR2_IM43_Pos)                /*!< 0x00000800 */
#define EXTI2_IMR2_IM43             EXTI2_IMR2_IM43_Msk                          /*!< Interrupt Mask on line 43 */
#define EXTI2_IMR2_IM44_Pos         (12U)
#define EXTI2_IMR2_IM44_Msk         (0x1UL << EXTI2_IMR2_IM44_Pos)                /*!< 0x00001000 */
#define EXTI2_IMR2_IM44             EXTI2_IMR2_IM44_Msk                          /*!< Interrupt Mask on line 44 */
/* No interrupt line 45 */
#define EXTI2_IMR2_IM46_Pos         (14U)
#define EXTI2_IMR2_IM46_Msk         (0x1UL << EXTI2_IMR2_IM46_Pos)                /*!< 0x00004000 */
#define EXTI2_IMR2_IM46             EXTI2_IMR2_IM46_Msk                          /*!< Interrupt Mask on line 46 */
#define EXTI2_IMR2_IM47_Pos         (15U)
#define EXTI2_IMR2_IM47_Msk         (0x1UL << EXTI2_IMR2_IM47_Pos)                /*!< 0x00008000 */
#define EXTI2_IMR2_IM47             EXTI2_IMR2_IM47_Msk                          /*!< Interrupt Mask on line 47 */
#define EXTI2_IMR2_IM48_Pos         (16U)
#define EXTI2_IMR2_IM48_Msk         (0x1UL << EXTI2_IMR2_IM48_Pos)                /*!< 0x00010000 */
#define EXTI2_IMR2_IM48             EXTI2_IMR2_IM48_Msk                          /*!< Interrupt Mask on line 48 */
#define EXTI2_IMR2_IM49_Pos         (17U)
#define EXTI2_IMR2_IM49_Msk         (0x1UL << EXTI2_IMR2_IM49_Pos)                /*!< 0x00020000 */
#define EXTI2_IMR2_IM49             EXTI2_IMR2_IM49_Msk                          /*!< Interrupt Mask on line 49 */
#define EXTI2_IMR2_IM50_Pos         (18U)
#define EXTI2_IMR2_IM50_Msk         (0x1UL << EXTI2_IMR2_IM50_Pos)                /*!< 0x00040000 */
#define EXTI2_IMR2_IM50             EXTI2_IMR2_IM50_Msk                          /*!< Interrupt Mask on line 50 */
#define EXTI2_IMR2_IM51_Pos         (19U)
#define EXTI2_IMR2_IM51_Msk         (0x1UL << EXTI2_IMR2_IM51_Pos)                /*!< 0x00080000 */
#define EXTI2_IMR2_IM51             EXTI2_IMR2_IM51_Msk                          /*!< Interrupt Mask on line 51 */
#define EXTI2_IMR2_IM52_Pos         (20U)
#define EXTI2_IMR2_IM52_Msk         (0x1UL << EXTI2_IMR2_IM52_Pos)                /*!< 0x00100000 */
#define EXTI2_IMR2_IM52             EXTI2_IMR2_IM52_Msk                          /*!< Interrupt Mask on line 52 */
#define EXTI2_IMR2_IM53_Pos         (21U)
#define EXTI2_IMR2_IM53_Msk         (0x1UL << EXTI2_IMR2_IM53_Pos)                /*!< 0x00200000 */
#define EXTI2_IMR2_IM53             EXTI2_IMR2_IM53_Msk                          /*!< Interrupt Mask on line 53 */
#define EXTI2_IMR2_IM54_Pos         (22U)
#define EXTI2_IMR2_IM54_Msk         (0x1UL << EXTI2_IMR2_IM54_Pos)                /*!< 0x00400000 */
#define EXTI2_IMR2_IM54             EXTI2_IMR2_IM54_Msk                          /*!< Interrupt Mask on line 54 */
#define EXTI2_IMR2_IM55_Pos         (23U)
#define EXTI2_IMR2_IM55_Msk         (0x1UL << EXTI2_IMR2_IM55_Pos)                /*!< 0x00800000 */
#define EXTI2_IMR2_IM55             EXTI2_IMR2_IM55_Msk                          /*!< Interrupt Mask on line 55 */
#define EXTI2_IMR2_IM56_Pos         (24U)
#define EXTI2_IMR2_IM56_Msk         (0x1UL << EXTI2_IMR2_IM56_Pos)                /*!< 0x01000000 */
#define EXTI2_IMR2_IM56             EXTI2_IMR2_IM56_Msk                          /*!< Interrupt Mask on line 56 */
/* No interrupt line 57 */
/* No interrupt line 58 */
#define EXTI2_IMR2_IM59_Pos         (27U)
#define EXTI2_IMR2_IM59_Msk         (0x1UL << EXTI2_IMR2_IM59_Pos)                /*!< 0x08000000 */
#define EXTI2_IMR2_IM59             EXTI2_IMR2_IM59_Msk                          /*!< Interrupt Mask on line 59 */
#define EXTI2_IMR2_IM60_Pos         (28U)
#define EXTI2_IMR2_IM60_Msk         (0x1UL << EXTI2_IMR2_IM60_Pos)                /*!< 0x10000000 */
#define EXTI2_IMR2_IM60             EXTI2_IMR2_IM60_Msk                          /*!< Interrupt Mask on line 60 */
#define EXTI2_IMR2_IM61_Pos         (29U)
#define EXTI2_IMR2_IM61_Msk         (0x1UL << EXTI2_IMR2_IM61_Pos)                /*!< 0x20000000 */
#define EXTI2_IMR2_IM61             EXTI2_IMR2_IM61_Msk                          /*!< Interrupt Mask on line 61 */
#define EXTI2_IMR2_IM62_Pos         (30U)
#define EXTI2_IMR2_IM62_Msk         (0x1UL << EXTI2_IMR2_IM62_Pos)                /*!< 0x40000000 */
#define EXTI2_IMR2_IM62             EXTI2_IMR2_IM62_Msk                          /*!< Interrupt Mask on line 62 */
#define EXTI2_IMR2_IM63_Pos         (31U)
#define EXTI2_IMR2_IM63_Msk         (0x1UL << EXTI2_IMR2_IM63_Pos)                /*!< 0x80000000 */
#define EXTI2_IMR2_IM63             EXTI2_IMR2_IM63_Msk                          /*!< Interrupt Mask on line 63 */

/*******************  Bit definition for EXTI2_CmEMR2 register  *******************/
#define EXTI2_EMR2_EM59_Pos         (27U)
#define EXTI2_EMR2_EM59_Msk         (0x1UL << EXTI2_EMR2_EM59_Pos)                 /*!< 0x08000000 */
#define EXTI2_EMR2_EM59             EXTI2_EMR2_EM59_Msk                           /*!< Interrupt Mask on line 59 */
#define EXTI2_EMR2_EM60_Pos         (28U)
#define EXTI2_EMR2_EM60_Msk         (0x1UL << EXTI2_EMR2_EM60_Pos)                 /*!< 0100000000 */
#define EXTI2_EMR2_EM60             EXTI2_EMR2_EM60_Msk                           /*!< Interrupt Mask on line 60 */
#define EXTI2_EMR2_EM61_Pos         (29U)
#define EXTI2_EMR2_EM61_Msk         (0x1UL << EXTI2_EMR2_EM61_Pos)                 /*!< 0x20000000 */
#define EXTI2_EMR2_EM61             EXTI2_EMR2_EM61_Msk                           /*!< Interrupt Mask on line 61 */

