zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp257dxx_cm0.h
/****************  Bit definition for GPIO_RCFGLOCKR register  ****************/
#define GPIO_RCFGLOCKR_RLOCK0_Pos      (0U)
#define GPIO_RCFGLOCKR_RLOCK0_Msk      (0x1UL << GPIO_RCFGLOCKR_RLOCK0_Pos)      /*!< 0x00000001 */
#define GPIO_RCFGLOCKR_RLOCK0          GPIO_RCFGLOCKR_RLOCK0_Msk                /*!< Port x security/privilege configuration lock for I/O pin y (y= 0 to 15)This bit can only be written by secure privileged application. This bit is cleared by default andonce set it cannot be reset until global GPIOx reset.If compartment filtering for this I/O pin is enabled (resp. disabled) using CFEN bit inGPIOx_CIDCFGRy, only an authorized compartment (resp. any compartment) can write thisbit, on top of secure and privileged restriction. Authorized compartment value depends on thevalue of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit inGPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_RCFGLOCKR_RLOCK1_Pos      (1U)
#define GPIO_RCFGLOCKR_RLOCK1_Msk      (0x1UL << GPIO_RCFGLOCKR_RLOCK1_Pos)      /*!< 0x00000002 */
#define GPIO_RCFGLOCKR_RLOCK1          GPIO_RCFGLOCKR_RLOCK1_Msk                /*!< Port x security/privilege configuration lock for I/O pin y (y= 0 to 15)This bit can only be written by secure privileged application. This bit is cleared by default andonce set it cannot be reset until global GPIOx reset.If compartment filtering for this I/O pin is enabled (resp. disabled) using CFEN bit inGPIOx_CIDCFGRy, only an authorized compartment (resp. any compartment) can write thisbit, on top of secure and privileged restriction. Authorized compartment value depends on thevalue of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit inGPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_RCFGLOCKR_RLOCK2_Pos      (2U)
#define GPIO_RCFGLOCKR_RLOCK2_Msk      (0x1UL << GPIO_RCFGLOCKR_RLOCK2_Pos)      /*!< 0x00000004 */
#define GPIO_RCFGLOCKR_RLOCK2          GPIO_RCFGLOCKR_RLOCK2_Msk                /*!< Port x security/privilege configuration lock for I/O pin y (y= 0 to 15)This bit can only be written by secure privileged application. This bit is cleared by default andonce set it cannot be reset until global GPIOx reset.If compartment filtering for this I/O pin is enabled (resp. disabled) using CFEN bit inGPIOx_CIDCFGRy, only an authorized compartment (resp. any compartment) can write thisbit, on top of secure and privileged restriction. Authorized compartment value depends on thevalue of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit inGPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_RCFGLOCKR_RLOCK3_Pos      (3U)
#define GPIO_RCFGLOCKR_RLOCK3_Msk      (0x1UL << GPIO_RCFGLOCKR_RLOCK3_Pos)      /*!< 0x00000008 */
#define GPIO_RCFGLOCKR_RLOCK3          GPIO_RCFGLOCKR_RLOCK3_Msk                /*!< Port x security/privilege configuration lock for I/O pin y (y= 0 to 15)This bit can only be written by secure privileged application. This bit is cleared by default andonce set it cannot be reset until global GPIOx reset.If compartment filtering for this I/O pin is enabled (resp. disabled) using CFEN bit inGPIOx_CIDCFGRy, only an authorized compartment (resp. any compartment) can write thisbit, on top of secure and privileged restriction. Authorized compartment value depends on thevalue of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit inGPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_RCFGLOCKR_RLOCK4_Pos      (4U)
#define GPIO_RCFGLOCKR_RLOCK4_Msk      (0x1UL << GPIO_RCFGLOCKR_RLOCK4_Pos)      /*!< 0x00000010 */
#define GPIO_RCFGLOCKR_RLOCK4          GPIO_RCFGLOCKR_RLOCK4_Msk                /*!< Port x security/privilege configuration lock for I/O pin y (y= 0 to 15)This bit can only be written by secure privileged application. This bit is cleared by default andonce set it cannot be reset until global GPIOx reset.If compartment filtering for this I/O pin is enabled (resp. disabled) using CFEN bit inGPIOx_CIDCFGRy, only an authorized compartment (resp. any compartment) can write thisbit, on top of secure and privileged restriction. Authorized compartment value depends on thevalue of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit inGPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_RCFGLOCKR_RLOCK5_Pos      (5U)
#define GPIO_RCFGLOCKR_RLOCK5_Msk      (0x1UL << GPIO_RCFGLOCKR_RLOCK5_Pos)      /*!< 0x00000020 */
#define GPIO_RCFGLOCKR_RLOCK5          GPIO_RCFGLOCKR_RLOCK5_Msk                /*!< Port x security/privilege configuration lock for I/O pin y (y= 0 to 15)This bit can only be written by secure privileged application. This bit is cleared by default andonce set it cannot be reset until global GPIOx reset.If compartment filtering for this I/O pin is enabled (resp. disabled) using CFEN bit inGPIOx_CIDCFGRy, only an authorized compartment (resp. any compartment) can write thisbit, on top of secure and privileged restriction. Authorized compartment value depends on thevalue of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit inGPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_RCFGLOCKR_RLOCK6_Pos      (6U)
#define GPIO_RCFGLOCKR_RLOCK6_Msk      (0x1UL << GPIO_RCFGLOCKR_RLOCK6_Pos)      /*!< 0x00000040 */
#define GPIO_RCFGLOCKR_RLOCK6          GPIO_RCFGLOCKR_RLOCK6_Msk                /*!< Port x security/privilege configuration lock for I/O pin y (y= 0 to 15)This bit can only be written by secure privileged application. This bit is cleared by default andonce set it cannot be reset until global GPIOx reset.If compartment filtering for this I/O pin is enabled (resp. disabled) using CFEN bit inGPIOx_CIDCFGRy, only an authorized compartment (resp. any compartment) can write thisbit, on top of secure and privileged restriction. Authorized compartment value depends on thevalue of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit inGPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_RCFGLOCKR_RLOCK7_Pos      (7U)
#define GPIO_RCFGLOCKR_RLOCK7_Msk      (0x1UL << GPIO_RCFGLOCKR_RLOCK7_Pos)      /*!< 0x00000080 */
#define GPIO_RCFGLOCKR_RLOCK7          GPIO_RCFGLOCKR_RLOCK7_Msk                /*!< Port x security/privilege configuration lock for I/O pin y (y= 0 to 15)This bit can only be written by secure privileged application. This bit is cleared by default andonce set it cannot be reset until global GPIOx reset.If compartment filtering for this I/O pin is enabled (resp. disabled) using CFEN bit inGPIOx_CIDCFGRy, only an authorized compartment (resp. any compartment) can write thisbit, on top of secure and privileged restriction. Authorized compartment value depends on thevalue of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit inGPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_RCFGLOCKR_RLOCK8_Pos      (8U)
#define GPIO_RCFGLOCKR_RLOCK8_Msk      (0x1UL << GPIO_RCFGLOCKR_RLOCK8_Pos)      /*!< 0x00000100 */
#define GPIO_RCFGLOCKR_RLOCK8          GPIO_RCFGLOCKR_RLOCK8_Msk                /*!< Port x security/privilege configuration lock for I/O pin y (y= 0 to 15)This bit can only be written by secure privileged application. This bit is cleared by default andonce set it cannot be reset until global GPIOx reset.If compartment filtering for this I/O pin is enabled (resp. disabled) using CFEN bit inGPIOx_CIDCFGRy, only an authorized compartment (resp. any compartment) can write thisbit, on top of secure and privileged restriction. Authorized compartment value depends on thevalue of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit inGPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_RCFGLOCKR_RLOCK9_Pos      (9U)
#define GPIO_RCFGLOCKR_RLOCK9_Msk      (0x1UL << GPIO_RCFGLOCKR_RLOCK9_Pos)      /*!< 0x00000200 */
#define GPIO_RCFGLOCKR_RLOCK9          GPIO_RCFGLOCKR_RLOCK9_Msk                /*!< Port x security/privilege configuration lock for I/O pin y (y= 0 to 15)This bit can only be written by secure privileged application. This bit is cleared by default andonce set it cannot be reset until global GPIOx reset.If compartment filtering for this I/O pin is enabled (resp. disabled) using CFEN bit inGPIOx_CIDCFGRy, only an authorized compartment (resp. any compartment) can write thisbit, on top of secure and privileged restriction. Authorized compartment value depends on thevalue of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit inGPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_RCFGLOCKR_RLOCK10_Pos     (10U)
#define GPIO_RCFGLOCKR_RLOCK10_Msk     (0x1UL << GPIO_RCFGLOCKR_RLOCK10_Pos)     /*!< 0x00000400 */
#define GPIO_RCFGLOCKR_RLOCK10         GPIO_RCFGLOCKR_RLOCK10_Msk               /*!< Port x security/privilege configuration lock for I/O pin y (y= 0 to 15)This bit can only be written by secure privileged application. This bit is cleared by default andonce set it cannot be reset until global GPIOx reset.If compartment filtering for this I/O pin is enabled (resp. disabled) using CFEN bit inGPIOx_CIDCFGRy, only an authorized compartment (resp. any compartment) can write thisbit, on top of secure and privileged restriction. Authorized compartment value depends on thevalue of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit inGPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_RCFGLOCKR_RLOCK11_Pos     (11U)
#define GPIO_RCFGLOCKR_RLOCK11_Msk     (0x1UL << GPIO_RCFGLOCKR_RLOCK11_Pos)     /*!< 0x00000800 */
#define GPIO_RCFGLOCKR_RLOCK11         GPIO_RCFGLOCKR_RLOCK11_Msk               /*!< Port x security/privilege configuration lock for I/O pin y (y= 0 to 15)This bit can only be written by secure privileged application. This bit is cleared by default andonce set it cannot be reset until global GPIOx reset.If compartment filtering for this I/O pin is enabled (resp. disabled) using CFEN bit inGPIOx_CIDCFGRy, only an authorized compartment (resp. any compartment) can write thisbit, on top of secure and privileged restriction. Authorized compartment value depends on thevalue of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit inGPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_RCFGLOCKR_RLOCK12_Pos     (12U)
#define GPIO_RCFGLOCKR_RLOCK12_Msk     (0x1UL << GPIO_RCFGLOCKR_RLOCK12_Pos)     /*!< 0x00001000 */
#define GPIO_RCFGLOCKR_RLOCK12         GPIO_RCFGLOCKR_RLOCK12_Msk               /*!< Port x security/privilege configuration lock for I/O pin y (y= 0 to 15)This bit can only be written by secure privileged application. This bit is cleared by default andonce set it cannot be reset until global GPIOx reset.If compartment filtering for this I/O pin is enabled (resp. disabled) using CFEN bit inGPIOx_CIDCFGRy, only an authorized compartment (resp. any compartment) can write thisbit, on top of secure and privileged restriction. Authorized compartment value depends on thevalue of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit inGPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_RCFGLOCKR_RLOCK13_Pos     (13U)
#define GPIO_RCFGLOCKR_RLOCK13_Msk     (0x1UL << GPIO_RCFGLOCKR_RLOCK13_Pos)     /*!< 0x00002000 */
#define GPIO_RCFGLOCKR_RLOCK13         GPIO_RCFGLOCKR_RLOCK13_Msk               /*!< Port x security/privilege configuration lock for I/O pin y (y= 0 to 15)This bit can only be written by secure privileged application. This bit is cleared by default andonce set it cannot be reset until global GPIOx reset.If compartment filtering for this I/O pin is enabled (resp. disabled) using CFEN bit inGPIOx_CIDCFGRy, only an authorized compartment (resp. any compartment) can write thisbit, on top of secure and privileged restriction. Authorized compartment value depends on thevalue of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit inGPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_RCFGLOCKR_RLOCK14_Pos     (14U)
#define GPIO_RCFGLOCKR_RLOCK14_Msk     (0x1UL << GPIO_RCFGLOCKR_RLOCK14_Pos)     /*!< 0x00004000 */
#define GPIO_RCFGLOCKR_RLOCK14         GPIO_RCFGLOCKR_RLOCK14_Msk               /*!< Port x security/privilege configuration lock for I/O pin y (y= 0 to 15)This bit can only be written by secure privileged application. This bit is cleared by default andonce set it cannot be reset until global GPIOx reset.If compartment filtering for this I/O pin is enabled (resp. disabled) using CFEN bit inGPIOx_CIDCFGRy, only an authorized compartment (resp. any compartment) can write thisbit, on top of secure and privileged restriction. Authorized compartment value depends on thevalue of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit inGPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_RCFGLOCKR_RLOCK15_Pos     (15U)
#define GPIO_RCFGLOCKR_RLOCK15_Msk     (0x1UL << GPIO_RCFGLOCKR_RLOCK15_Pos)     /*!< 0x00008000 */
#define GPIO_RCFGLOCKR_RLOCK15         GPIO_RCFGLOCKR_RLOCK15_Msk               /*!< Port x security/privilege configuration lock for I/O pin y (y= 0 to 15)This bit can only be written by secure privileged application. This bit is cleared by default andonce set it cannot be reset until global GPIOx reset.If compartment filtering for this I/O pin is enabled (resp. disabled) using CFEN bit inGPIOx_CIDCFGRy, only an authorized compartment (resp. any compartment) can write thisbit, on top of secure and privileged restriction. Authorized compartment value depends on thevalue of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit inGPIOx_SEMCRy. See the bits descriptions for details. */

