zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp257dxx_cm0.h
/********************  Bits definition for TAMP_SMISR register  ************ *****/
#define TAMP_SMISR_TAMP1MF_Pos       (0U)
#define TAMP_SMISR_TAMP1MF_Msk       (0x1UL << TAMP_SMISR_TAMP1MF_Pos)                  /*!< 0x00000001U */
#define TAMP_SMISR_TAMP1MF           TAMP_SMISR_TAMP1MF_Msk
#define TAMP_SMISR_TAMP2MF_Pos       (1U)
#define TAMP_SMISR_TAMP2MF_Msk       (0x1UL << TAMP_SMISR_TAMP2MF_Pos)                  /*!< 0x00000002U */
#define TAMP_SMISR_TAMP2MF           TAMP_SMISR_TAMP2MF_Msk
#define TAMP_SMISR_TAMP3MF_Pos       (2U)
#define TAMP_SMISR_TAMP3MF_Msk       (0x1UL << TAMP_SMISR_TAMP3MF_Pos)                  /*!< 0x00000004U */
#define TAMP_SMISR_TAMP3MF           TAMP_SMISR_TAMP3MF_Msk
#define TAMP_SMISR_TAMP4MF_Pos       (3U)
#define TAMP_SMISR_TAMP4MF_Msk       (0x1UL << TAMP_SMISR_TAMP4MF_Pos)                  /*!< 0x00000008U */
#define TAMP_SMISR_TAMP4MF           TAMP_SMISR_TAMP4MF_Msk
#define TAMP_SMISR_TAMP5MF_Pos       (4U)
#define TAMP_SMISR_TAMP5MF_Msk       (0x1UL << TAMP_SMISR_TAMP5MF_Pos)                  /*!< 0x00000010U */
#define TAMP_SMISR_TAMP5MF           TAMP_SMISR_TAMP5MF_Msk
#define TAMP_SMISR_TAMP6MF_Pos       (5U)
#define TAMP_SMISR_TAMP6MF_Msk       (0x1UL << TAMP_SMISR_TAMP6MF_Pos)                  /*!< 0x00000020U */
#define TAMP_SMISR_TAMP6MF           TAMP_SMISR_TAMP6MF_Msk
#define TAMP_SMISR_TAMP7MF_Pos       (6U)
#define TAMP_SMISR_TAMP7MF_Msk       (0x1UL << TAMP_SMISR_TAMP7MF_Pos)                  /*!< 0x00000040U */
#define TAMP_SMISR_TAMP7MF           TAMP_SMISR_TAMP7MF_Msk
#define TAMP_SMISR_TAMP8MF_Pos       (7U)
#define TAMP_SMISR_TAMP8MF_Msk       (0x1UL << TAMP_SMISR_TAMP8MF_Pos)                  /*!< 0x00000080U */
#define TAMP_SMISR_TAMP8MF           TAMP_SMISR_TAMP8MF_Msk
#define TAMP_SMISR_ITAMP1MF_Pos      (16U)
#define TAMP_SMISR_ITAMP1MF_Msk      (0x1UL << TAMP_SMISR_ITAMP1MF_Pos)                 /*!< 0x00010000U */
#define TAMP_SMISR_ITAMP1MF          TAMP_SMISR_ITAMP1MF_Msk
#define TAMP_SMISR_ITAMP2MF_Pos      (17U)
#define TAMP_SMISR_ITAMP2MF_Msk      (0x1UL << TAMP_SMISR_ITAMP2MF_Pos)                 /*!< 0x00020000U */
#define TAMP_SMISR_ITAMP2MF          TAMP_SMISR_ITAMP2MF_Msk
#define TAMP_SMISR_ITAMP3MF_Pos      (18U)
#define TAMP_SMISR_ITAMP3MF_Msk      (0x1UL << TAMP_SMISR_ITAMP3MF_Pos)                 /*!< 0x00040000U */
#define TAMP_SMISR_ITAMP3MF          TAMP_SMISR_ITAMP3MF_Msk
#define TAMP_SMISR_ITAMP4MF_Pos      (19U)
#define TAMP_SMISR_ITAMP4MF_Msk      (0x1UL << TAMP_SMISR_ITAMP4MF_Pos)                 /*!< 0x00080000U */
#define TAMP_SMISR_ITAMP4MF          TAMP_SMISR_ITAMP4MF_Msk
#define TAMP_SMISR_ITAMP5MF_Pos      (20U)
#define TAMP_SMISR_ITAMP5MF_Msk      (0x1UL << TAMP_SMISR_ITAMP5MF_Pos)                 /*!< 0x00100000U */
#define TAMP_SMISR_ITAMP5MF          TAMP_SMISR_ITAMP5MF_Msk
#define TAMP_SMISR_ITAMP6MF_Pos      (21U)
#define TAMP_SMISR_ITAMP6MF_Msk      (0x1UL << TAMP_SMISR_ITAMP6MF_Pos)                 /*!< 0x00200000U */
#define TAMP_SMISR_ITAMP6MF          TAMP_SMISR_ITAMP6MF_Msk
#define TAMP_SMISR_ITAMP7MF_Pos      (22U)
#define TAMP_SMISR_ITAMP7MF_Msk      (0x1UL << TAMP_SMISR_ITAMP7MF_Pos)                 /*!< 0x00400000U */
#define TAMP_SMISR_ITAMP7MF          TAMP_SMISR_ITAMP7MF_Msk
#define TAMP_SMISR_ITAMP8MF_Pos      (23U)
#define TAMP_SMISR_ITAMP8MF_Msk      (0x1UL << TAMP_SMISR_ITAMP8MF_Pos)                 /*!< 0x00800000U */
#define TAMP_SMISR_ITAMP8MF          TAMP_SMISR_ITAMP8MF_Msk
#define TAMP_SMISR_ITAMP9MF_Pos      (24U)
#define TAMP_SMISR_ITAMP9MF_Msk      (0x1UL << TAMP_SMISR_ITAMP9MF_Pos)                 /*!< 0x01000000U */
#define TAMP_SMISR_ITAMP9MF          TAMP_SMISR_ITAMP9MF_Msk
#define TAMP_SMISR_ITAMP10MF_Pos     (25U)
#define TAMP_SMISR_ITAMP10MF_Msk     (0x1UL << TAMP_SMISR_ITAMP10MF_Pos)                /*!< 0x020400000U */
#define TAMP_SMISR_ITAMP10MF         TAMP_SMISR_ITAMP10MF_Msk
#define TAMP_SMISR_ITAMP11MF_Pos     (26U)
#define TAMP_SMISR_ITAMP11MF_Msk     (0x1UL << TAMP_SMISR_ITAMP11MF_Pos)                /*!< 0x020400000U */
#define TAMP_SMISR_ITAMP11MF         TAMP_SMISR_ITAMP11MF_Msk
#define TAMP_SMISR_ITAMP12MF_Pos     (27U)
#define TAMP_SMISR_ITAMP12MF_Msk     (0x1UL << TAMP_SMISR_ITAMP12MF_Pos)                /*!< 0x080000000U */
#define TAMP_SMISR_ITAMP12MF         TAMP_SMISR_ITAMP12MF_Msk
#define TAMP_SMISR_ITAMP14MF_Pos     (29U)
#define TAMP_SMISR_ITAMP14MF_Msk     (0x1UL << TAMP_SMISR_ITAMP14MF_Pos)                /*!< 0x200000000U */
#define TAMP_SMISR_ITAMP14MF         TAMP_SMISR_ITAMP14MF_Msk
#define TAMP_SMISR_ITAMP15MF_Pos     (30U)
#define TAMP_SMISR_ITAMP15MF_Msk     (0x1UL << TAMP_SMISR_ITAMP15MF_Pos)                /*!< 0x400000000U */
#define TAMP_SMISR_ITAMP15MF         TAMP_SMISR_ITAMP15MF_Msk

/********************  Bits definition for TAMP_SCR register  *****************/
#define TAMP_SCR_CTAMP1F_Pos         (0U)
#define TAMP_SCR_CTAMP1F_Msk         (0x1UL << TAMP_SCR_CTAMP1F_Pos)                    /*!< 0x00000001U */
#define TAMP_SCR_CTAMP1F             TAMP_SCR_CTAMP1F_Msk
#define TAMP_SCR_CTAMP2F_Pos         (1U)
#define TAMP_SCR_CTAMP2F_Msk         (0x1UL << TAMP_SCR_CTAMP2F_Pos)                    /*!< 0x00000002U */
#define TAMP_SCR_CTAMP2F             TAMP_SCR_CTAMP2F_Msk
#define TAMP_SCR_CTAMP3F_Pos         (2U)
#define TAMP_SCR_CTAMP3F_Msk         (0x1UL << TAMP_SCR_CTAMP3F_Pos)                    /*!< 0x00000004U */
#define TAMP_SCR_CTAMP3F             TAMP_SCR_CTAMP3F_Msk
#define TAMP_SCR_CTAMP4F_Pos         (3U)
#define TAMP_SCR_CTAMP4F_Msk         (0x1UL << TAMP_SCR_CTAMP4F_Pos)                    /*!< 0x00000008U */
#define TAMP_SCR_CTAMP4F             TAMP_SCR_CTAMP4F_Msk
#define TAMP_SCR_CTAMP5F_Pos         (4U)
#define TAMP_SCR_CTAMP5F_Msk         (0x1UL << TAMP_SCR_CTAMP5F_Pos)                    /*!< 0x00000010U */
#define TAMP_SCR_CTAMP5F             TAMP_SCR_CTAMP5F_Msk
#define TAMP_SCR_CTAMP6F_Pos         (5U)
#define TAMP_SCR_CTAMP6F_Msk         (0x1UL << TAMP_SCR_CTAMP6F_Pos)                    /*!< 0x00000020U */
#define TAMP_SCR_CTAMP6F             TAMP_SCR_CTAMP6F_Msk
#define TAMP_SCR_CTAMP7F_Pos         (6U)
#define TAMP_SCR_CTAMP7F_Msk         (0x1UL << TAMP_SCR_CTAMP7F_Pos)                    /*!< 0x00000040U */
#define TAMP_SCR_CTAMP7F             TAMP_SCR_CTAMP7F_Msk
#define TAMP_SCR_CTAMP8F_Pos         (7U)
#define TAMP_SCR_CTAMP8F_Msk         (0x1UL << TAMP_SCR_CTAMP8F_Pos)                    /*!< 0x00000080U */
#define TAMP_SCR_CTAMP8F             TAMP_SCR_CTAMP8F_Msk
#define TAMP_SCR_CITAMP1F_Pos        (16U)
#define TAMP_SCR_CITAMP1F_Msk        (0x1UL << TAMP_SCR_CITAMP1F_Pos)                   /*!< 0x00010000U */
#define TAMP_SCR_CITAMP1F            TAMP_SCR_CITAMP1F_Msk
#define TAMP_SCR_CITAMP2F_Pos        (17U)
#define TAMP_SCR_CITAMP2F_Msk        (0x1UL << TAMP_SCR_CITAMP2F_Pos)                   /*!< 0x00020000U */
#define TAMP_SCR_CITAMP2F            TAMP_SCR_CITAMP2F_Msk
#define TAMP_SCR_CITAMP3F_Pos        (18U)
#define TAMP_SCR_CITAMP3F_Msk        (0x1UL << TAMP_SCR_CITAMP3F_Pos)                   /*!< 0x00040000U */
#define TAMP_SCR_CITAMP3F            TAMP_SCR_CITAMP3F_Msk
#define TAMP_SCR_CITAMP4F_Pos        (19U)
#define TAMP_SCR_CITAMP4F_Msk        (0x1UL << TAMP_SCR_CITAMP4F_Pos)                   /*!< 0x00080000U */
#define TAMP_SCR_CITAMP4F            TAMP_SCR_CITAMP4F_Msk
#define TAMP_SCR_CITAMP5F_Pos        (20U)
#define TAMP_SCR_CITAMP5F_Msk        (0x1UL << TAMP_SCR_CITAMP5F_Pos)                   /*!< 0x00100000U */
#define TAMP_SCR_CITAMP5F            TAMP_SCR_CITAMP5F_Msk
#define TAMP_SCR_CITAMP6F_Pos        (21U)
#define TAMP_SCR_CITAMP6F_Msk        (0x1UL << TAMP_SCR_CITAMP6F_Pos)                   /*!< 0x00200000U */
#define TAMP_SCR_CITAMP6F            TAMP_SCR_CITAMP6F_Msk
#define TAMP_SCR_CITAMP7F_Pos        (22U)
#define TAMP_SCR_CITAMP7F_Msk        (0x1UL << TAMP_SCR_CITAMP7F_Pos)                   /*!< 0x00400000U */
#define TAMP_SCR_CITAMP7F            TAMP_SCR_CITAMP7F_Msk
#define TAMP_SCR_CITAMP8F_Pos        (23U)
#define TAMP_SCR_CITAMP8F_Msk        (0x1UL << TAMP_SCR_CITAMP8F_Pos)                   /*!< 0x00800000U */
#define TAMP_SCR_CITAMP8F            TAMP_SCR_CITAMP8F_Msk
#define TAMP_SCR_CITAMP9F_Pos        (24U)
#define TAMP_SCR_CITAMP9F_Msk        (0x1UL << TAMP_SCR_CITAMP9F_Pos)                   /*!< 0x01000000U */
#define TAMP_SCR_CITAMP9F            TAMP_SCR_CITAMP9F_Msk
#define TAMP_SCR_CITAMP10F_Pos       (25U)
#define TAMP_SCR_CITAMP10F_Msk       (0x1UL << TAMP_SCR_CITAMP10F_Pos)                  /*!< 0x02000000U */
#define TAMP_SCR_CITAMP10F           TAMP_SCR_CITAMP10F_Msk
#define TAMP_SCR_CITAMP11F_Pos       (26U)
#define TAMP_SCR_CITAMP11F_Msk       (0x1UL << TAMP_SCR_CITAMP11F_Pos)                  /*!< 0x04000000U */
#define TAMP_SCR_CITAMP11F           TAMP_SCR_CITAMP11F_Msk
#define TAMP_SCR_CITAMP12F_Pos       (27U)
#define TAMP_SCR_CITAMP12F_Msk       (0x1UL << TAMP_SCR_CITAMP12F_Pos)                  /*!< 0x08000000U */
#define TAMP_SCR_CITAMP12F           TAMP_SCR_CITAMP12F_Msk
#define TAMP_SCR_CITAMP14F_Pos       (29U)
#define TAMP_SCR_CITAMP14F_Msk       (0x1UL << TAMP_SCR_CITAMP14F_Pos)                  /*!< 0x20000000U */
#define TAMP_SCR_CITAMP14F           TAMP_SCR_CITAMP14F_Msk
#define TAMP_SCR_CITAMP15F_Pos       (30U)
#define TAMP_SCR_CITAMP15F_Msk       (0x1UL << TAMP_SCR_CITAMP15F_Pos)                  /*!< 0x40000000U */
#define TAMP_SCR_CITAMP15F           TAMP_SCR_CITAMP15F_Msk

/*******************  Bits definition for TAMP_COUNT1R register  **************/
#define TAMP_COUNT1R_Pos              (0U)
#define TAMP_COUNT1R_Msk              (0xFFFFFFFFUL << TAMP_COUNT1R_Pos)               /*!< 0xFFFFFFFFU */
#define TAMP_COUNT1R                  TAMP_COUNT1R_Msk

